// RIBBON MENU - MAIN MENU
IDS_MAIN_RIBBON_MENU_Main                     = "Main"
IDS_RIBBON_MAIN_MENU_NEW                      = "New"
IDS_RIBBON_MAIN_MENU_OPEN                     = "Open..."
IDS_RIBBON_MAIN_MENU_CLOSE                    = "Close"
IDS_RIBBON_MAIN_MENU_SAVE                     = "Save"
IDS_RIBBON_MAIN_MENU_SAVEAS                   = "Save As..."
IDS_RIBBON_MAIN_MENU_IMPORT                   = "Import..."
IDS_RIBBON_MAIN_MENU_EXPORT                   = "Export..."
IDS_RIBBON_MAIN_MENU_BATCHPRINT               = "Batch Print..."
IDS_RIBBON_MAIN_MENU_REGTEST                  = "Regression Test..."
IDS_RIBBON_MAIN_MENU_MRU_FILE                 = "Recent Files"
IDS_RIBBON_MAIN_MENU_EXIT                     = "Exit Design+"
IDS_RIBBON_MAIN_MENU_UNDO                     = "Undo"
IDS_RIBBON_MAIN_MENU_REDO                     = "Redo"
IDS_RIBBON_MAIN_MENU_UNDOLIST                 = "Undo List"
IDS_RIBBON_MAIN_MENU_REDOLIST                 = "Redo List"

// RIBBON MENU - MODE & LINK
IDS_RIBBON_BARR_MODELINK                      = "Mode/Link"
IDS_RIBBON_PANL_MODE_UI                       = "UI Mode"
IDS_RIBBON_MENU_MODE_PROJECT                  = "Project Mode"
IDS_RIBBON_MENU_MODE_SIMPLE                   = "Simple Mode"
IDS_RIBBON_MENU_MODE_CHECK                    = "Check Mode"

IDS_RIBBON_PANL_LINK                          = "midas Link"
IDS_RIBBON_MENU_LINK_MIDAS                    = "midas Link"
IDS_RIBBON_MENU_LINK_OPTION                   = "Link Option"
IDS_RIBBON_MENU_LINK_DATABASE                 = "Link DataBase"

IDS_RIBBON_PANL_MODE_EDIT                     = "Edit Mode"
IDS_RIBBON_MENU_MODE_INPUT_FORM               = "Member"
IDS_RIBBON_MENU_MODE_LIST_FORM                = "Member List"
IDS_RIBBON_MENU_MODE_DWG_FORM                 = "Drawing"
IDS_RIBBON_MENU_MODE_QUAN_FORM                = "Quantity"
IDS_RIBBON_MENU_MODE_CHECK_FORM               = "Check"

// RIBBON MENU - RC MEMBER
IDS_RIBBON_BARR_RCS                           = "RC"
IDS_RIBBON_PANL_RCS_CONC                      = "Reinforced Concrete"
IDS_RIBBON_MENU_RCS_SLAB                      = "Slab"
IDS_RIBBON_MENU_RCS_BEAM                      = "Beam"
IDS_RIBBON_MENU_RCS_COLUMN                    = "Column"
IDS_RIBBON_MENU_RCS_GENCOLUMN                 = "General Column"
IDS_RIBBON_MENU_RCS_SHEAR_WALL                = "Shear Wall"
IDS_RIBBON_MENU_RCS_COMB_WALL                 = "Combined Wall"
IDS_RIBBON_MENU_RCS_BASEMENT_WALL             = "Basement Wall"
IDS_RIBBON_MENU_RCS_RETAIN_WALL               = "Retaining Wall"
IDS_RIBBON_MENU_RCS_ANCHOR_BOLT               = "Anchor Bolt"
IDS_RIBBON_MENU_RCS_BUTTRESS                  = "Buttress"
IDS_RIBBON_MENU_RCS_STAIR                     = "Stair"
IDS_RIBBON_MENU_RCS_CORBEL                    = "Corbel / Bracket"

IDS_RIBBON_PANL_RCS_FOOTING                   = "Footing"
IDS_RIBBON_MENU_RCS_FOUNDATION                = "Footing"
IDS_RIBBON_MENU_RCS_ISO_FOOTING               = "Isolated Footing"
IDS_RIBBON_MENU_RCS_COMB_FOOTING              = "Combined Footing"
IDS_RIBBON_MENU_RCS_STRIP_FOOTING             = "Strip Footing"

IDS_RIBBON_PANL_RCS_TABLE                     = "Table"
IDS_RIBBON_MENU_RCS_BEAM_LIST                 = "Beam Table"
IDS_RIBBON_MENU_RCS_SLAB_LIST                 = "Slab Table"

IDS_RIBBON_PANL_RCS_BATCH_BEAM                = "Batch Beam"
IDS_RIBBON_MENU_RCS_BATCH_BEAM                = "Batch Beam"
IDS_RIBBON_MENU_RCS_BEAM_SMARTDGN_OPT         = "Smart Design Option"
IDS_RIBBON_MENU_RCS_BEAM_SMARTDGN_BLD         = "Building Data Setting"
IDS_RIBBON_MENU_RCS_BEAM_SMARTDGN_ALL         = "Run Smart Design ( All )"

IDS_RIBBON_PANL_RCS_BATCH_COLUMN              = "Batch Column"
IDS_RIBBON_MENU_RCS_BATCH_COLUMN              = "Batch Column"
IDS_RIBBON_MENU_RCS_COLUMN_SMARTDGN_OPT       = "Smart Design Option"
IDS_RIBBON_MENU_RCS_COLUMN_SMARTDGN_BLD       = "Building Data Setting"
IDS_RIBBON_MENU_RCS_COLUMN_SMARTDGN_ALL       = "Run Smart Design ( All )"

IDS_RIBBON_PANL_RCS_BATCHWALL                 = "Batch Wall"
IDS_RIBBON_MENU_RCS_BATCH_WALL                = "Batch Wall"
IDS_RIBBON_MENU_RCS_WALL_SMARTDGN_OPT         = "Smart Design Option"
IDS_RIBBON_MENU_RCS_WALL_SMARTDGN_BLD         = "Building Data Setting"
IDS_RIBBON_MENU_RCS_WALL_SMARTDGN_ALL         = "Run Smart Design ( All )"

// RIBBON MENU - STEEL MEMBER
IDS_RIBBON_BARR_STL                           = "Steel"
IDS_RIBBON_PANL_STL                           = "Steel"
IDS_RIBBON_MENU_STL_BEAM_COLUMN               = "Beam / Column"
IDS_RIBBON_MENU_STL_BASE_PLATE                = "Base Plate"
IDS_RIBBON_MENU_STL_BOLT_CONNECTION           = "Bolt Connect"
IDS_RIBBON_MENU_STL_MOMENT_BOLT               = "Moment Connect by Bolt"
IDS_RIBBON_MENU_STL_CRANE_GIRDER              = "Crane Girder"
IDS_RIBBON_MENU_STL_PURLIN_GIRT               = "Purlin / Girth"
IDS_RIBBON_MENU_STL_WEB_OPENING               = "Web Opening"
IDS_RIBBON_MENU_STL_WELDING                   = "Welding"
IDS_RIBBON_MENU_STL_EMBEDPLATE                = "Embedded Plate"
IDS_RIBBON_MENU_STL_STAIR                     = "Stair"
IDS_RIBBON_MENU_STL_CORWEB_BEAM               = "Corrugated Web Beam"

IDS_RIBBON_PANL_SEISMIC_DESIGN_TOOL           = "Seismic Design Tool"
IDS_RIBBON_MENU_STL_TOOL_UNBRACE_LENGTH       = "Unbraced Length"
IDS_RIBBON_MENU_STL_TOOL_BRACE_STRENGTH       = "Brace Strength"
IDS_RIBBON_MENU_STL_TOOL_LINK_STIFFENER       = "Link Stiffener"
IDS_RIBBON_MENU_STL_TOOL_BEAMSTR_VBRACE       = "Beam Strength"

// RIBBON MENU - SRC MEMBER
IDS_RIBBON_BARR_SRC                           = "SRC"
IDS_RIBBON_PANL_SRC                           = "SRC"
IDS_RIBBON_MENU_SRC_COMPOSITE_BEAM            = "Composite Beam"
IDS_RIBBON_MENU_SRC_BASE_PLATE                = "Base Plate"
IDS_RIBBON_MENU_SRC_COLUMN                    = "SRC Column"
IDS_RIBBON_MENU_SRC_CFT_COLUMN                = "CFT Column"

// RIBBON MENU - ALUMINUM MEMBER
IDS_RIBBON_BARR_ALU                           = "Aluminum"
IDS_RIBBON_PANL_ALU                           = "Aluminum"
IDS_RIBBON_MENU_ALU_BEAMCOL                   = "Beam / Column"
IDS_RIBBON_MENU_ALU_BEAMCOLGEN                = "General Beam / Column"

// RIBBON MENU - REINFORCEMENT MEMBER
IDS_RIBBON_BARR_RFM                           = "Reinforce"
IDS_RIBBON_PANL_RFM_CONC                      = "Reinforcement"
IDS_RIBBON_MENU_RFM_SLAB                      = "Slab"
IDS_RIBBON_MENU_RFM_BEAM                      = "Beam"
IDS_RIBBON_MENU_RFM_COLUMN                    = "Column"

// RIBBON MENU - RC MEMBER
IDS_RIBBON_BARR_PBD                           = "PBD"
IDS_RIBBON_PANL_PBD_CONC                      = "Reinforced Concrete"
IDS_RIBBON_MENU_PBD_RCS_BEAM                  = "Beam"
IDS_RIBBON_MENU_PBD_RCS_COLUMN                = "Column"
IDS_RIBBON_MENU_PBD_RCS_WALL                  = "Shear Wall"

// RIBBON MENU - LOAD
IDS_RIBBON_BARR_LOAD                          = "Load"
IDS_RIBBON_PANL_LOAD                          = "Load"
IDS_RIBBON_MENU_LOAD_DESIGN_LOAD              = "Design Load"
IDS_RIBBON_MENU_LOAD_IMPORT_LOAD              = "Import"
IDS_RIBBON_MENU_LOAD_EXPORT_WORD              = "Export Word"
IDS_RIBBON_MENU_LOAD_EXPORT_RTF               = "Export Word RTF"
IDS_RIBBON_MENU_LOAD_EXPORT_EXCEL             = "Export Excel"
IDS_RIBBON_MENU_LOAD_LOAD_COMB                = "Load Combination"

// RIBBON MENU - OPTION
IDS_RIBBON_BARR_OPTION                        = "Option"
IDS_RIBBON_PANL_SETTING                       = "Setting"
IDS_RIBBON_MENU_SET_DGNCODE                   = "Design Code"
IDS_RIBBON_MENU_SET_DATABASE                  = "Data Base"

IDS_RIBBON_PANL_OPTION                        = "Option"
IDS_RIBBON_MENU_OPT_BAROPT                    = "Rebar Option"
IDS_RIBBON_MENU_OPT_STLOPT                    = "Steel Option"
IDS_RIBBON_MENU_OPT_ALUOPT                    = "Aluminum Option"

IDS_RIBBON_PANL_DGN_OPTION                    = "Option ( Member )"
IDS_RIBBON_MENU_OPT_DGN_OPTION                = "Design Option"
IDS_RIBBON_MENU_OPT_CHK_OPTION                = "Check Option"
IDS_RIBBON_MENU_OPT_DWG_OPTION                = "Drawing Option"
IDS_RIBBON_MENU_OPT_RPT_OPTION                = "Report Option"

IDS_RIBBON_PANL_OPT_PREFER                    = "Preference"
IDS_RIBBON_MENU_OPT_PREFER                    = "Preference"
IDS_RIBBON_MENU_OPT_IMPORT_PREF               = "Import Preference"
IDS_RIBBON_MENU_OPT_INITDATA                  = "Initial Data Setting ( Registry )"

// RIBBON MENU - TOOL
IDS_RIBBON_BARR_TOOL                          = "Tool"
IDS_RIBBON_PANL_TOOL_TOOLS                    = "Tool"
IDS_RIBBON_MENU_TOOL_BATCH_DESIGN             = "Batch Design"
IDS_RIBBON_MENU_TOOL_REORDER_MEMBLIST         = "Reorder Member"
IDS_RIBBON_MENU_TOOL_UNIT_CONV                = "Unit Converter"
IDS_RIBBON_MENU_TOOL_DEVELOP_LENGTH           = "Dev. Splice Calculator"

IDS_RIBBON_PANL_TOOL_TABLE                    = "Data Table"
IDS_RIBBON_MENU_TOOL_BAR_TABLE                = "Rebar Table"
IDS_RIBBON_MENU_TOOL_BAR_INFO                 = "Rebar DB"
IDS_RIBBON_MENU_TOOL_SECT_INFO                = "Steel Section DB"

IDS_RIBBON_PANL_TOOL_DEFAULT                  = "Default Setting"
IDS_RIBBON_MENU_TOOL_SET_DEFAULT_ALL          = "Set Default Data ( All )"
IDS_RIBBON_MENU_TOOL_SET_DEFAULT_CUR          = "Set Default Data ( Current )"
IDS_RIBBON_MENU_TOOL_SET_DEFAULT_DEL          = "Reset Default Data"

IDS_RIBBON_PANL_TOOL_CONVERT                  = "Data Conversion"
IDS_RIBBON_MENU_TOOL_CONVERT_URGC             = "RC Column to General Column"
IDS_RIBBON_MENU_TOOL_CONVERT_UCCO             = "RC Column to SRC Column"
IDS_RIBBON_MENU_TOOL_CONVERT_URDW             = "RC Combined Wall to Gen Wall [ Debug ]"

// RIBBON MENU - DEV TOOL
IDS_RIBBON_BARR_DEVTOOL                       = "Development Tool"
IDS_RIBBON_PANL_DEVTOOL_REGTEST               = "Regression Test"
IDS_RIBBON_MENU_DEVTOOL_REGTEST               = "Reg. Test"
IDS_RIBBON_MENU_DEVTOOL_EXPORT                = "Export"
IDS_RIBBON_MENU_DEVTOOL_RENAME                = "Rename"
IDS_RIBBON_PANL_DEVTOOL_STRING                = "String Tool"
IDS_RIBBON_MENU_DEVTOOL_STR_CONVERT           = "String Converter ( INI File )"
IDS_RIBBON_MENU_DEVTOOL_STR_ALIGNER           = "String Aligner"
IDS_RIBBON_MENU_DEVTOOL_STR_FILECOPY          = "String File Copy"
IDS_RIBBON_PANL_DEVTOOL_DLG                   = "Dialog"
IDS_RIBBON_MENU_DEVTOOL_DLGCTRL               = "Dialog Control Samples"
IDS_RIBBON_PANL_DEVTOOL_CONVERTER             = "Converter"
IDS_RIBBON_MENU_DEVTOOL_CONVERTER             = "Data Converter"

// RIBBON MENU - VIEW
IDS_RIBBON_BARR_VIEW                          = "View"
IDS_RIBBON_PANL_VIEW_VIEW                     = "View"
IDS_RIBBON_MENU_VIEW_STATUSBAR                = "Status Bar"
IDS_RIBBON_MENU_VIEW_TOPMOST                  = "Always Top"

IDS_RIBBON_PANL_VIEW_APPLOOK                  = "Application Look"
IDS_RIBBON_MENU_VIEW_APPLOOK_2000             = "Office 2000"
IDS_RIBBON_MENU_VIEW_APPLOOK_XP               = "Office XP"
IDS_RIBBON_MENU_VIEW_APPLOOK_2003             = "Office 2003"
IDS_RIBBON_MENU_VIEW_APPLOOK_VS2005           = "VS.NET 2005"
IDS_RIBBON_MENU_VIEW_APPLOOK_WIN_XP           = "Windows XP"
IDS_RIBBON_MENU_VIEW_APPLOOK_2007             = "Office 2007"

// RIBBON MENU - WINDOW
IDS_RIBBON_BARR_WINDOW                        = "Window"
IDS_RIBBON_PANL_WINDOW                        = "Window"
IDS_RIBBON_MENU_WINDOW_CASCADE                = "Cascade"
IDS_RIBBON_MENU_WINDOW_TILE_HORZ              = "Tile (Horizontal)"
IDS_RIBBON_MENU_WINDOW_TILE_VERT              = "Tile (Vertical)"
IDS_RIBBON_MENU_WINDOW_ARRANGE                = "Arrange Icons"

// RIBBON MENU - HELP
IDS_RIBBON_BARR_HELP                          = "Help"
IDS_RIBBON_PANL_HELP_HELP                     = "Help"
IDS_RIBBON_MENU_HELP_FINDER                   = "Index"
IDS_RIBBON_MENU_HELP_CONTENTS                 = "Contents"
IDS_RIBBON_MENU_HELP_SEARCHHELP               = "Search"

IDS_RIBBON_PANL_HELP_WEB                      = "Web Site"
IDS_RIBBON_MENU_HELP_MIDASHOME                = "Midas HomePage"
IDS_RIBBON_MENU_HELP_MIDASQNA                 = "Q/A"
IDS_RIBBON_MENU_HELP_MIDASREQ                 = "Request for Improvements"
IDS_RIBBON_MENU_HELP_REGISTERID               = "Register New ID"
IDS_RIBBON_MENU_HELP_FAQ                      = "FAQ"
IDS_RIBBON_MENU_HELP_BUGFIXLIST               = "Bug Fix List"
IDS_RIBBON_MENU_HELP_SHOW_START               = "Start Page"

IDS_RIBBON_PANL_HELP_REGISTER                 = "Register"
IDS_RIBBON_MENU_HELP_REGISTER                 = "Register Protection"
IDS_RIBBON_MENU_APP_ABOUT                     = "About Design+"

// IDR_MAINFRAME MENU
MAINFRM_MENU_POPUP_FILE                       = "&File"
MAINFRM_ID_FILE_NEW                           = "&New\tCtrl+N"
MAINFRM_ID_FILE_OPEN                          = "&Open...\tCtrl+O"
MAINFRM_ID_FILE_PRINT_SETUP                   = "P&rint Setup..."
MAINFRM_ID_FILE_MRU_FILE1                     = "Recent File"
MAINFRM_ID_APP_EXIT                           = "E&xit"

MAINFRM_MENU_POPUP_VIEW                       = "&View"
MAINFRM_MENU_POPUP_TOOLBARS                   = "&Toolbars"
MAINFRM_ID_VIEW_TOOLBARSMENUITEM              = ""
MAINFRM_ID_VIEW_STATUS_BARMENUITEM            = "&Status Bar"
MAINFRM_MENU_POPUP_APP_LOOK                   = "&Application Look"
MAINFRM_ID_VIEW_APPLOOK_2000                  = "Office &2000"
MAINFRM_ID_VIEW_APPLOOK_XP                    = "Office &XP"
MAINFRM_ID_VIEW_APPLOOK_2003                  = "Office 200&3"
MAINFRM_ID_VIEW_APPLOOK_VS2005                = "Visual Studio.NET 200&5"
MAINFRM_ID_VIEW_APPLOOK_WIN_XP                = "&Windows XP"
MAINFRM_ID_VIEW_APPLOOK_2007                  = "Office 200&7"
MAINFRM_MENU_POPUP_HELP                       = "&Help"
MAINFRM_ID_APP_ABOUT                          = "&About Design+..."
MAINFRM_ID_HELP_SHOW_START                    = "Show Start Page"

// IDR_DPLUSTYPE MENU
MENU_POPUP_FILE                               = "&File"
ID_FILE_NEW                                   = "&New"
ID_FILE_OPEN                                  = "&Open..."
ID_FILE_CLOSE                                 = "&Close"
ID_FILE_SAVE                                  = "&Save"
ID_FILE_SAVE_AS                               = "Save &As..."
ID_FILE_IMPORT                                = "&Import..."
ID_FILE_EXPORT                                = "&Export..."
ID_FILE_BATCH_PRINT                           = "Batch Print..."
ID_FILE_REGTEST                               = "Regression Test..."
ID_FILE_MRU_FILE1                             = "Recent File"
ID_APP_EXIT                                   = "E&xit"

MENU_POPUP_EDIT                               = "&Edit"
ID_EDIT_UNDO                                  = "&Undo\tCtrl+Z"
ID_EDIT_REDO                                  = "&Redo\tCtrl+R"

MENU_POPUP_VIEW                               = "&View"
MENU_POPUP_TOOLBAR                            = "&Toolbars"
ID_VIEW_TOOLBARS                              = ""
ID_VIEW_STATUS_BAR                            = "&Status Bar"
MENU_POPUP_APP_LOCK                           = "&Application Look"
ID_VIEW_APPLOOK_2000                          = "Office &2000"
ID_VIEW_APPLOOK_XP                            = "Office &XP"
ID_VIEW_APPLOOK_2003                          = "Office 200&3"
ID_VIEW_APPLOOK_VS2005                        = "Visual Studio.NET 200&5"
ID_VIEW_APPLOOK_WIN_XP                        = "&Windows XP"
ID_VIEW_APPLOOK_2007                          = "Office 200&7"

ID_VIEW_INPUT_FORM                            = "&Member"
ID_VIEW_LIST_FORM                             = "Member &List"
ID_VIEW_DWG_FORM                              = "&Drawing"
ID_VIEW_QUAN_FORM                             = "&Quantity"
ID_VIEW_CHECK_FORM                            = "&Check"

MENU_POPUP_RCS                                = "&RC"
ID_DGN_RCS_SLAB                               = "&Slab"
ID_DGN_RCS_BEAM                               = "&Beam"
ID_DGN_RCS_COLUMN                             = "&Column"
ID_DGN_RCS_GENCOLUMN                          = "Column (&General)"
ID_DGN_RCS_SHEAR_WALL                         = "Shear &Wall"
ID_DGN_RCS_COMB_WALL                          = "Shear Wall (Combined)"
ID_DGN_FOUNDATION                             = "&Footing"
ID_DGN_COMB_FOOTING                           = "Footing (Combined)"
ID_DGN_STRIP_FOOTING                          = "Footing (Strip)"
ID_DGN_RCS_BASEMENT_WALL                      = "Base&ment Wall"
ID_DGN_RCS_RETAIN_WALL                        = "Retaining Wall"
ID_DGN_RCS_ANCHOR_BOLT                        = "Anchor Bolt"
ID_DGN_RCS_BUTTRESS                           = "Bu&ttress"
ID_DGN_RCS_STAIR                              = "Stai&r"
ID_DGN_RCS_CORBEL                             = "C&orbel/Bracket"
ID_DGN_RCS_BEAM_LIST                          = "Bea&m Table"
ID_DGN_RCS_SLAB_LIST                          = "Sl&ab Table"
ID_DGN_RCS_BATCH_WALL                         = "Batc&h Wall"

MENU_POPUP_SMART_DGN                          = "Smart Design ( Batch Wall )"
ID_DGN_RCS_WALL_SMARTDGN_OPT                  = "Smart Design Option..."
ID_DGN_RCS_WALL_SMARTDGN_BLD                  = "Building Data Setting..."
ID_DGN_RCS_WALL_SMARTDGN_ALL                  = "Run Smart Design ( All )"

MENU_POPUP_STL                                = "&Steel"
ID_DGN_STEEL_BEAM_COLUMN                      = "&Beam && Column"
ID_DGN_STEEL_BASE_PLATE                       = "Base &Plate"
ID_DGN_STEEL_BOLT_CONNECTION                  = "Bolt &Connection"
ID_DGN_STEEL_CRANE_GIRDER                     = "Crane &Girder"
ID_DGN_STEEL_PURLIN_GIRT                      = "P&urlin && Girth"
ID_DGN_STEEL_WEB_OPENING                      = "Web &Opening"
ID_DGN_STEEL_WELDING                          = "&Welding"
ID_DGN_STEEL_EMBEDPLATE                       = "&Embedded Plate"
ID_DGN_STEEL_STAIR                            = "Steel &Stair"

MENU_POPUP_SRC                                = "SR&C"
ID_DGN_SRC_COMPOSITE_BEAM                     = "&Composite Beam"
ID_DGN_SRC_BASE_PLATE                         = "&Base Plate"
ID_DGN_SRC_COLUMN                             = "&SRC Column"
ID_DGN_SRC_CFT_COLUMN                         = "C&FT Column"

MENU_POPUP_ALU                                = "&Aluminum"
ID_DGN_ALU_BEAMCOL                            = "&Beam && Column"
ID_DGN_ALU_BEAMCOLGEN                         = "Beam && &Column (General)"

MENU_POPUP_LOAD                               = "L&oad"
ID_LOAD_DESIGN_LOAD                           = "&Design Load..."
ID_LOAD_IMPORT_DESIGN_LOAD                    = "&Import Design Load..."
MENU_POPUP_LOAD_EXPORT                        = "&Export Design Load"
ID_LOAD_EXPORT_WORD                           = "Microsoft &Word"
ID_LOAD_EXPORT_EXCEL                          = "Microsoft &Excel"
ID_LOAD_LOAD_COMB                             = "Load Combination..."

MENU_POPUP_OPTION                             = "&Option"
ID_OPT_OPTION                                 = "&Option..."
ID_OPT_DATABASE                               = "&Data Base Option..."
ID_OPT_REBAR                                  = "&Rebar Option..."
ID_OPT_INITDATA                               = "Initial Data Setting (Registry)..."
ID_OPT_STEEL_OPTION                           = "&Steel Option..."
ID_OPT_ALU_OPTION                             = "&Aluminum Option..."
ID_OPT_DGN_OPTION                             = "&Design Option..."
ID_OPT_DWG_OPTION                             = "&Drawing Option..."
ID_OPT_PREFERENCE                             = "&Preference..."
ID_OPT_CHECK_OPTION                           = "&Check Option..."
ID_OPT_TOPMOST                                = "Always on &Top"

MENU_POPUP_MODE                               = "&Mode"
ID_MODE_PROJECT                               = "&Project Mode"
ID_MODE_SIMPLE                                = "&Simple Mode"
ID_MODE_CHECK                                 = "&Check Mode"

MENU_POPUP_TOOL                               = "&Tool"
ID_TOOL_BATCH_DESIGN                          = "&Batch Design..."
ID_TOOL_SET_DEFAULT_ALL                       = "&Set Default Data ( All ) ..."
ID_TOOL_SET_DEFAULT_CUR                       = "Set Default Data ( Current )\tCtrl+D"
ID_TOOL_SET_DEFAULT_DEL                       = "Reset Default Data"
ID_TOOL_REORDER_MEMBERLIST                    = "&Reorder Member List..."
ID_TOOL_IMPORT_PREF                           = "Import &Preference..."
ID_TOOL_CONVERT_URGC                          = "RC Column -> General Column ..."
ID_TOOL_CONVERT_UCCO                          = "RC Column -> SRC Column ..."
ID_TOOL_CONVERT_URDW                          = "RC Combined Wall -> Gen Wall [Debug]"
ID_TOOL_BAR_TABLE                             = "Rebar &Table ..."
ID_TOOL_BAR_INFO                              = "Rebar &Information ..."
ID_TOOL_SECT_INFO                             = "Steel Section Information ..."
ID_TOOL_UNIT_CONV                             = "&Unit Converter ..."
ID_TOOL_DEVELOP_LENGTH                        = "&Development && Splice Length Calculator ..."

MENU_POPUP_LINK                               = "&Link"
ID_LINK_MIDAS_FAMILY                          = "midas &Link..."
ID_LINK_OPTION                                = "Link &Option..."

MENU_POPUP_WINDOW                             = "&Window"
ID_WINDOW_CASCADE                             = "&Cascade"
ID_WINDOW_TILE_HORZ                           = "&Tile"
ID_WINDOW_ARRANGE                             = "&Arrange Icons"

MENU_POPUP_HELP                               = "&Help"
ID_HELP_REGISTER                              = "&Register Protection License..."
ID_HELP_FINDER                                = "&Index...\tF1"
ID_HELP_CONTENTS                              = "&Contents"
ID_HELP_SEARCHHELP                            = "&Search for Help on..."
MENU_POPUP_HELP_WEB                           = "Midas on the &Web"
ID_HELP_MIDASHOME                             = "Midas &Home Page"
ID_HELP_MIDASQNA                              = "Q/A"
ID_HELP_REGISTERID                            = "Register New ID"
ID_HELP_LICENSING_CONF                        = "Program Licensing Configuration"
ID_HELP_FAQ                                   = "FAQ"
ID_HELP_MIDASREQ                              = "Request for Improvements"
ID_HELP_BUGFIXLIST                            = "Bug Fix List"
ID_HELP_SHOW_START                            = "Show Start Page"
ID_APP_ABOUT                                  = "&About Design+..."

// Context Menu of Worktree
ID_WORKTREE_LIST_DIALOG                       = "Member List..."
ID_WORKTREE_SHOW_ALL                          = "Show All..."
ID_WORKTREE_HIDE_ALL                          = "Hide All..."
ID_WORKTREE_SELECT_ALL                        = "Select All..."
ID_WORKTREE_UNSELECT_ALL                      = "Unselect All..."
ID_WORKTREE_ADD                               = "Add..."
ID_WORKTREE_DELETEALL                         = "Delete All"
ID_WORKTREE_GROUP                             = "Group..."
ID_WORKTREE_REORDER                           = "Reordering..."
ID_WORKTREE_SORT_ATOZ                         = "Sort by A-to-Z"
ID_WORKTREE_SORT_ZTOA                         = "Sort by Z-to-A"

ID_WORKTREE_SHOW                              = "Show..."
ID_WORKTREE_HIDE                              = "Hide..."
ID_WORKTREE_SELECT                            = "Select"
ID_WORKTREE_UNSELECT                          = "Unselect"
ID_WORKTREE_EDIT                              = "Rename..."
ID_WORKTREE_COPY                              = "Copy"
ID_WORKTREE_DELETE                            = "Delete"
ID_WORKTREE_REPORT_DWG                        = "Dwg && Report"
ID_WORKTREE_DWGONLY                           = "Dwg Only"
ID_WORKTREE_REPORTONLY                        = "Report Only"
ID_WORKTREE_NOTOUTPUT                         = "Not Output"
ID_WORKTREE_BY_MEMBER                         = "By Member"

// Context Menu
ID_MAIN_CONTEXT_COPY                          = "&Copy"
ID_MAIN_CONTEXT_SELECT_ALL                    = "&Select All"
ID_MAIN_CONTEXT_CLEAR                         = "Clear &All"

// Main Input Page
ID_SLAB_NORMAL                                = "Slab"
ID_SLAB_REINFORCE                             = "Reinforced Slab"
ID_URBE_NORMAL                                = "Beam"
ID_URBE_REINFORCE                             = "Reinforced Beam"
ID_UFDN_ISOLATED                              = "Isolated Footing"
ID_UFDN_COMBINE                               = "Combined Footing"
ID_UFDN_STRIP                                 = "Strip Footing"
ID_URCO_REGULAR                               = "Column"
ID_URCO_GENERAL                               = "General Section Column"
ID_URCO_REINFORCE                             = "Reinforced Column"
ID_URSW_SHEAR                                 = "Shear Wall"
ID_URSW_COMBINE                               = "Combined Wall"
ID_URBL_BEAMLIST                              = "Beam Table"
ID_URSL_SLABLIST                              = "Slab Table"
ID_UAAG_REGULAR                               = "DB Section"
ID_UAAG_GENERAL                               = "General Section"
ID_URBW_BASEWALL                              = "Basement Wall"
ID_URBW_CANTILEVER                            = "Cantilever Retaining Wall"
ID_BATCH_DGN_BEAM                             = "Batch Beam"
ID_BATCH_DGN_COLUMN							  = "Batch Column"
ID_BATCH_DGN_WALL                             = "Batch Wall"
ID_USSG_BEAM_COLM                             = "Beam / Column"
ID_USSG_CWEB_BEAM                             = "Corrugated Web Beam"
ID_USBP_BASEPLATE                             = "Base Plate"
ID_USBP_EMBEDPLATE                            = "Embedded Plate"
ID_USBC_BOLT_CONNECT                          = "Bolt Connection"
ID_USBC_MOMENT_BOLT                           = "Moment Bolt Connection"

// Popup MENU
ID_POPUP_MENU_DET                             = "Detail"
ID_POPUP_MENU_SUM                             = "Summary"
ID_POPUP_MENU_INP                             = "Input List"
ID_POPUP_MENU_DET_DOC                         = "Word : Detail"
ID_POPUP_MENU_SUM_DOC                         = "Word : Summary"
ID_POPUP_MENU_INP_DOC                         = "Word : Input List"
ID_POPUP_MENU_DET_RTF                         = "Word RTF : Detail"
ID_POPUP_MENU_SUM_RTF                         = "Word RTF : Summary"
ID_POPUP_MENU_INP_RTF                         = "Word RTF : Input List"
ID_POPUP_MENU_DET_XLS                         = "Excel : Detail"
ID_POPUP_MENU_SUM_XLS                         = "Excel : Summary"
ID_POPUP_MENU_INP_XLS                         = "Excel : Input List"
ID_POPUP_MENU_DET_LBX                         = "LibXL : Detail"
ID_POPUP_MENU_SUM_LBX                         = "LibXL : Summary"
ID_POPUP_MENU_INP_LBX                         = "LibXL : Input List"
ID_POPUP_MENU_DET_TXT                         = "Text : Detail"
ID_POPUP_MENU_SUM_TXT                         = "Text : Summary"
ID_POPUP_MENU_INP_TXT                         = "Text : Input List"
ID_GURGW_REPORT_WORD                          = "Microsoft Word"
ID_GURGW_REPORT_RTF                           = "Microsoft Word RTF"
ID_GURGW_REPORT_EXCEL                         = "Microsoft Excel"
ID_POPUP_MENU_RGW_SECT_EDIT                   = "Section Edit Table"
ID_POPUP_MENU_RGW_WALL_MARK                   = "Wall Mark Result Table"

// DgnListBtnDlg
ID_LIST_BTN_DLG_MENU_DET_DOC                  = "Word : Detail"
ID_LIST_BTN_DLG_MENU_SUM_DOC                  = "Word : Summary"
ID_LIST_BTN_DLG_MENU_INP_DOC                  = "Word : Input List"
ID_LIST_BTN_DLG_MENU_DET_RTF                  = "Word RTF : Detail"
ID_LIST_BTN_DLG_MENU_SUM_RTF                  = "Word RTF : Summary"
ID_LIST_BTN_DLG_MENU_INP_RTF                  = "Word RTF : Input List"
ID_LIST_BTN_DLG_MENU_DET_XLS                  = "Excel : Detail"
ID_LIST_BTN_DLG_MENU_SUM_XLS                  = "Excel : Summary"
ID_LIST_BTN_DLG_MENU_INP_XLS                  = "Excel : Input List"
ID_LIST_BTN_DLG_MENU_DET_LBX                  = "LibXL : Detail"
ID_LIST_BTN_DLG_MENU_SUM_LBX                  = "LibXL : Summary"
ID_LIST_BTN_DLG_MENU_INP_LBX                  = "LibXL : Input List"
ID_LIST_BTN_DLG_MENU_DET_TXT                  = "Text : Detail"
ID_LIST_BTN_DLG_MENU_SUM_TXT                  = "Text : Summary"
ID_LIST_BTN_DLG_MENU_INP_TXT                  = "Text : Input List"
ID_LIST_BTN_DLG_MENU_BAT_DOC                  = "Microsoft Word"
ID_LIST_BTN_DLG_MENU_BAT_XLS                  = "Microsoft Excel"

// Report View Popup MENU
ID_DGN_REPORT_FIT_SIZE                        = "Resize to Fit"
ID_DGN_REPORT_POPUP_MENU_DOC                  = "Word Document"
ID_DGN_REPORT_POPUP_MENU_RTF                  = "Word RTF Document"
ID_DGN_REPORT_POPUP_MENU_XLS                  = "Excel Spreadsheet"
ID_DGN_REPORT_POPUP_MENU_LBX                  = "LibXL Spreadsheet"
ID_DGN_REPORT_POPUP_MENU_TXT                  = "Text File"
